model {
  center_net {
    num_classes: 1
    feature_extractor {
      type: "hourglass_104"
      channel_means: 104.01362
      channel_means: 114.034225
      channel_means: 119.916595
      channel_stds: 73.60277
      channel_stds: 69.89082
      channel_stds: 70.91508
      bgr_ordering: true
    }
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 512
        max_dimension: 512
        pad_to_max_dimension: true
      }
    }
    object_detection_task {
      task_loss_weight: 1.0
      offset_loss_weight: 1.0
      scale_loss_weight: 0.1
      localization_loss {
        l1_localization_loss {
        }
      }
    }
    object_center_params {
      object_center_loss_weight: 1.0
      classification_loss {
        penalty_reduced_logistic_focal_loss {
          alpha: 2.0
          beta: 4.0
        }
      }
      min_box_overlap_iou: 0.7
      max_box_predictions: 3000
    }
  }
}
train_config {
  batch_size: 2
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_vertical_flip {
    }
  }
  data_augmentation_options {
    random_rotation90 {
    }
  }
  data_augmentation_options {
    random_jitter_boxes {
    }
  }
  data_augmentation_options {
    random_crop_image {
      min_aspect_ratio: 0.5
      max_aspect_ratio: 1.7
      random_coef: 0.25
    }
  }
  data_augmentation_options {
    random_adjust_hue {
    }
  }
  data_augmentation_options {
    random_adjust_contrast {
    }
  }
  data_augmentation_options {
    random_adjust_saturation {
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
    }
  }
  data_augmentation_options {
    random_absolute_pad_image {
      max_height_padding: 200
      max_width_padding: 200
      pad_color: 0.0
      pad_color: 0.0
      pad_color: 0.0
    }
  }
  optimizer {
    adam_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.001
          schedule {
            step: 90000
            learning_rate: 0.0001
          }
          schedule {
            step: 120000
            learning_rate: 1e-05
          }
        }
      }
      epsilon: 1e-07
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "/mnt/c/Users/insleker/Google Drive/workspace/riceCV/code/centernet_hg104_512x512_coco17_tpu-8/checkpoint0/ckpt-0"
  num_steps: 140000
  max_number_of_boxes: 3000
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "fine_tune"
  fine_tune_checkpoint_version: V2
}
train_input_reader {
  label_map_path: "/mnt/c/Users/insleker/Google Drive/workspace/riceCV/code/data/rice_label_map.pbtxt"
  tf_record_input_reader {
    input_path: "/mnt/c/Users/insleker/Google Drive/workspace/riceCV/code/data/riceOdTrain.tfrecord"
  }
  max_number_of_boxes: 3000
}
eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  max_num_boxes_to_visualize: 3000
  batch_size: 1
}
eval_input_reader {
  label_map_path: "/mnt/c/Users/insleker/Google Drive/workspace/riceCV/code/data/rice_label_map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "/mnt/c/Users/insleker/Google Drive/workspace/riceCV/code/data/riceOdEval.tfrecord"
  }
  max_number_of_boxes: 3000
}
